//
//  SearchTableViewController.swift
//  testTableViewSegue
//
//  Created by Dovran on 05.08.17.
//  Copyright © 2017 Dovran Reyimov. All rights reserved.
//

import UIKit

class SearchTableViewController: UITableViewController {
    
    var searchName = [String]()
    var SearchPrice = [String]()
    var SearchImage = [String]()
    
    
    var searchFood: [CollectionFood] = []
    
    var searchController: UISearchController!
    var filteredResultArray: [CollectionFood] = []
    
    
    func filterContentFor(searchText text: String) {
        filteredResultArray = searchFood.filter { (foodSearch: CollectionFood) -> Bool in
            return (foodSearch.name.contains(text.lowercased()))
        }
    }
    override func viewDidLoad() {
        super.viewDidLoad()
        
        searchController = UISearchController(searchResultsController: nil)
        searchController.searchResultsUpdater = self
        searchController.dimsBackgroundDuringPresentation = false
        tableView.tableHeaderView = searchController.searchBar
    }
    
    
    override func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return searchName.count
    }
    
    override func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView.dequeueReusableCell(withIdentifier: "searchCell") as! SearchTableViewCell
        
        cell.searchNameLabel.text = searchName [indexPath.row]
        cell.searchPriceLabel.text = SearchPrice [indexPath.row]
        cell.searchImage.image = UIImage(named: SearchImage[indexPath.row])
        
        return cell
    }
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
  
    
    //Супы
    var food = [CollectionFood(name: ["Куриный суп","Томатный суп","Мексиканский суп","Минестроне овощной","Том ям","Тыквенный суп с сыром Фета и фисташками", "Чечевичный острый по-Мороканский", "Крем суп-грибной"],
                               gram: [""],
                               type: [""],
                               price: ["12 ман","12 ман","16 ман","12 ман","50 ман","20 ман","25 ман","17 ман"],
                               image: ["Суп","Суп","Суп","Суп","Суп","Суп","Суп","Суп"]),
                //Холодные закуски
        CollectionFood(name: ["Брускетта с песто и пармезаном","Брускетта класическая","Карпачо из сёмги","Багет с сёмгой","Сырное ассорти","Закуска на чипсах с тунцом"],
                       gram: [""],
                       type: [""],
                       price: ["15 ман","10 ман","45 ман","40 ман","70 ман","19 ман"],
                       image: ["Холодные_закуски","Холодные_закуски","Холодные_закуски","Холодные_закуски","Холодные_закуски","Холодные_закуски"]),
        //Горячие закуски
        CollectionFood(name: ["Рёсти с сёмгой","Блинчики с мясом","Блинчики с курицей","Закуска 'Melbourne'"],
                       gram: [""],
                       type: [""],
                       price: ["45 ман","25 ман","25 ман","65 ман"],
                       image: ["Горячие_закуски","Горячие_закуски","Горячие_закуски","Горячие_закуски"]),
        //Салаты
        CollectionFood(name: ["Цезарь с куриной грудкой","Цезарь с креветками","Салат с жаренным сыром (Халуми)","Греческий салат","Капризе","Салат мясной Де Карсе","Салат из овощей на гриле","Нисуаз","Тёплый салат с кальмарами","Салат с морепродуктами и апельсинами","Овощной с креветками","Тёплый летний салат с сёмгой","Салат 'Ля Рус'","Салат 'Виктория'"],
                       gram: [""],
                       type: [""],
                       price: ["33 ман","50 ман","32 ман","23 ман","40 ман","36 ман","27 ман","40 ман","50 ман","55 ман","37 ман","45 ман","28 ман","35 ман"],
                       image: ["Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты","Салаты"]),
        //Бургеры премьер Мельбурн
        CollectionFood(name: ["Гамбургер 'Мельбурн'","Гамбургер","Чизбургер","Вегетарианский гамбургер","Сэндвич с куриной грудкой","Сэндвия с говяжьей вырезкой","Сэндвич с ростбифом","Мини бургеры Сет (3шт)","Мини бургеры Сет (6шт)"],
                       gram: [""],
                       type: [""],
                       price: ["32 ман","25 ман","27 ман","10 ман","23 ман","27 ман","27 ман","30 ман","42 ман"],
                       image: ["Бургеры","Бургеры","Бургеры","Бургеры","Бургеры","Бургеры","Бургеры","Бургеры","Бургеры"]),
        //Паста
        CollectionFood(name: ["Фузилли с колбасками и курицей от шеф повара","Овощное спагетти & Куриные бёдрышки с кунжутом","Лингвини с креветками от Джейми Оливера","Фузилли с лососем","Карбонара","Спагетти по вегетариански","Таглиателли с курицей и грибами в сливках","Паста 'Аль арабьята'","Паста 'Болоньезе'","Тартелонни с креветками и сёмгой"],
                       gram: [""],
                       type: [""],
                       price: ["40 ман","42 ман","60 ман","50 ман","40 ман","30 ман","40 ман","25 ман","45 ман","48 ман"],
                       image: ["Паста","Паста","Паста","Паста","Паста","Паста","Паста","Паста","Паста","Паста"]),
        //Пицца
        CollectionFood(name: ["Маргарита","Куриная","Ассорти","Пепперони","С морепродуктами","Вегетарианская","С тунцом острая с луком","Хачапури"],
                       gram: [""],
                       type: [""],
                       price: ["30 ман","35 ман","40 ман","45 ман","65 ман","35 ман","45 ман","35 ман"],
                       image: ["Пицца","Пицца","Пицца","Пицца","Пицца","Пицца","Пицца","Пицца"]),
        //Горячие блюда из мяса
        CollectionFood(name: ["Медальоны с беконом","Фахитос","Бараньи рёбрышки с соусом карри и рисом","Торнадо","Бон филе на подушке из шпината со сливками","Филе 'Миньон' с картофелем по-деревенски","Говяжий эскалоп в лимонном соусе","Микс гриль (на двоих)"],
                       gram: [""],
                       type: [""],
                       price: ["50 ман","55 ман","45 ман","60 ман","52 ман","65 ман","55 ман","150 ман"],
                       image: ["Мясо","Мясо","Мясо","Мясо","Мясо","Мясо","Мясо","Мясо"]),
        //Стейки
        CollectionFood(name: ["Rib Steak","Стейк из вырезки молодого телёнка","Нежная вырезка обжаренная на гриле соломкой"],
                       gram: [""],
                       type: [""],
                       price: ["62","55","55"],
                       image: ["Стейк","Стейк","Стейк"]),
        //Горячие блюда из курицы
        CollectionFood(name: ["Цыплёнок табака с соусом ткемали","Шницель","Нежная грудка на гриле","Нежная грудка в сливочном соусе","Куриная грудка с сыром Фета","Куриная грудка с беконом и пармезаном","Курица в кисло-сладком соусе с чёрным рисом"],
                       gram: [""],
                       type: [""],
                       price: ["47 ман","40 ман","30 ман","38 ман","35 ман","57 ман","45 ман"],
                       image: ["Курица","Курица","Курица","Курица","Курица","Курица","Курица"]),
        //Горячие блюда из рыбы
        CollectionFood(name: ["Дорадо на гриле","Форель на гриле","Форель запечёная с овощами","Сёмга на гриле","Сёмга терияки","Сёмга с кускусом","Семга запечёная в духовке с овощами и винегретом","Креветки королевские на гриле","Запечёные мидии под сыром","Судак в сливочном соусе","Микс-темпура"],
                       gram: [""],
                       type: [""],
                       price: ["70 ман","70 ман","75 ман","69 ман","78 ман","75 ман","60 ман","70 ман","55 ман","45 ман","70 ман"],
                       image: ["Рыба","Рыба","Рыба","Рыба","Рыба","Рыба","Рыба","Рыба","Рыба","Рыба","Рыба"]),
        
        //Гарниры
        CollectionFood(name: ["Картофельное пюре","Картофель фри","Картофель с грибами и зеленью","Овощи на гриле","Овощи тушёные","Рис басмати","Шампиньоны"],
                       gram: [""],
                       type: [""],
                       price: ["10 ман","13 ман","11 ман","15 ман","15 ман","11 ман","12 ман"],
                       image: ["Гарнир","Гарнир","Гарнир","Гарнир","Гарнир","Гарнир","Гарнир"]),
        
        //Десерты
        CollectionFood(name: ["Морковный торт с кремом из маскарпоне","Тирамису","Чизкейк шоколадный","Чизкейк малиновый","Наполеон","Блинчик с бананом и малиновым соусом","Мороженое в ассортименте","Мороженое с фруктами","Фруктовое ассорти","Торт 'Павлова' с экзотическими фруктами"],
                       gram: [""],
                       type: [""],
                       price: ["25 ман","25 ман","25 ман","25 ман","15 ман","15 ман","20 ман","30 ман","45 ман","25 ман"],
                       image: ["Десерт","Десерт","Десерт","Десерт","Десерт","Десерт","Десерт","Десерт","Десерт","Десерт"]),]
    
}




extension SearchTableViewController: UISearchResultsUpdating {
    func updateSearchResults(for searchController: UISearchController) {
        filterContentFor(searchText: searchController.searchBar.text!)
        tableView.reloadData()
    }
}
